<?php

namespace Database\Seeders;

use App\Models\Donation;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Faker\Factory as Faker;


class DonationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $plateNames = [
            'كبة باللحمة والصنوبر',
            'شاورما دجاج مع صوص الثوم',
            'مندي الدجاج التقليدي',
            'فتة حمص مع الطحينة واللحمة',
            'رز مع الحمص والخضار المشكلة',
            'مكرونة بالباشميل',
            'شوربة خضار مع العدس',
            'فطائر بالجبنة والزعتر',
            'كفتة اللحم بالبصل والبهارات',
            'منقوشة بالزعتر وزيت الزيتون',
            'سلطة الفتوش بالخضار المشكلة',
            'كبسة الدجاج مع الخضار والأرز',
            'حلوى البقلاوة بالفستق',
            'سمبوسة بالجبنة والزعتر',
            'معجنات محشية باللحمة المفرومة',
            'منقوشة الجبنة بالعسل',
            'فول مدمس مع الطحينة والليمون',
            'مقبلات خضار مشكلة',
            'كعك العيد بالتمر والفستق',
            'سلطة التبولة الطازجة'
        ];

        $descriptions = [
            '<p>كبة باللحمة والصنوبر، طبق شهي يتميز بنكهة اللحمة المفرومة وحبات الصنوبر.</p>',
            '<p>شاورما دجاج مع صوص الثوم، دجاج مشوي بطريقة تقليدية مع صوص الثوم اللذيذ.</p>',
            '<p>مندي الدجاج التقليدي، طبق شهير يتضمن دجاج مطبوخ بطريقة خاصة مع الأرز.</p>',
            '<p>فتة حمص مع الطحينة واللحمة، طبق شرقي يحتوي على حمص ولحمة وصوص الطحينة.</p>',
            '<p>رز مع الحمص والخضار المشكلة، طبق يحتوي على الرز المطبوخ مع حمص وخضار مشكلة.</p>',
            '<p>مكرونة بالباشميل، مكرونة مغطاة بصلصة الباشميل اللذيذة والمميزة.</p>',
            '<p>شوربة خضار مع العدس، شوربة غنية بالخضار والعدس ذات الطعم الرائع.</p>',
            '<p>فطائر بالجبنة والزعتر، فطائر صغيرة ولذيذة محشوة بالجبنة والزعتر.</p>',
            '<p>كفتة اللحم بالبصل والبهارات، كفتة لحم مشكلة بنكهة البصل والبهارات.</p>',
            '<p>منقوشة بالزعتر وزيت الزيتون، خبز منقوش بالزعتر ورشة من زيت الزيتون.</p>',
            '<p>سلطة الفتوش بالخضار المشكلة، سلطة منعشة تحتوي على خضار متنوعة وصلصة الليمون.</p>',
            '<p>كبسة الدجاج مع الخضار والأرز، طبق يحتوي على الدجاج والخضار والأرز المطهو معًا.</p>',
            '<p>حلوى البقلاوة بالفستق، حلوى عربية شهيرة محشوة بالفستق.</p>',
            '<p>سمبوسة بالجبنة والزعتر، سمبوسة صغيرة ولذيذة محشوة بالجبنة والزعتر.</p>',
            '<p>معجنات محشية باللحمة المفرومة، معجنات صغيرة محشوة باللحمة المفرومة.</p>',
            '<p>منقوشة الجبنة بالعسل، خبز منقوش بالجبنة ويزين بالعسل.</p>',
            '<p>فول مدمس مع الطحينة والليمون، فول مطبوخ بشكل مميز مع صوص الطحينة وعصير الليمون.</p>',
            '<p>مقبلات خضار مشكلة، صحن يحتوي على مقبلات متنوعة من الخضار.</p>',
            '<p>كعك العيد بالتمر والفستق، كعك تقليدي محشو بالتمر ومزين بالفستق.</p>',
            '<p>سلطة التبولة الطازجة، سلطة تبولة منعشة مع مكوناتها الطازجة.</p>',
        ];

        $faker = Faker::create('ar_SA');

        foreach ($plateNames as $index => $plateName) {
            $description = $descriptions[$index];

            $imageUrl = 'donation_images/' . str_replace(' ', '_', strtolower($plateName)) . '.jpg';

            Donation::create([
                'donor_id' => $faker->numberBetween(1, 4),
                'donation_name' => $plateName,
                'description' => $description,
                'image_url' => $imageUrl,
                'quantity_type' => 'طبق',
                'quantity' => $faker->numberBetween(1, 10), // Random quantity between 1 and 20
                'expiration_date' => $faker->dateTimeBetween('now', '+1 years')->format('Y-m-d'), // Random expiration date within 2 years from now
            ]);
        }
    }
}
